{
  "posters": [
    {
      "id": 1,
      "title": "India is the 4th largest economy in the world now",
      "image": "https://res.cloudinary.com/diuimvolk/image/upload/v1756900997/posters/xkejqzkq6z9cd8vc5iir.avif",
      "link": ""
    },
    {
      "id": 2,
      "title": "Poster 2",
      "image": "https://res.cloudinary.com/diuimvolk/image/upload/v1756900998/posters/mokjht5unapmvu6kumq8.webp",
      "link": ""
    },
    {
      "id": 3,
      "title": "Poster 3",
      "image": "https://res.cloudinary.com/diuimvolk/image/upload/v1756210466/posters/zwjj9h2d4bacspkj0zj7.jpg",
      "link": ""
    }
  ],
  "breakingNews": [
    {
      "id": 1756895668331,
      "headline": "\"Rebuke To Trump\": What US Media Reported On PM Modi, Putin Meeting",
      "shortDescription": "PM Modi and Putin met for the first time after the US imposed tariffs on India and shared bonhomie with handshakes, hugs, and long talks.",
      "fullDescription": "\"Rebuke To Trump\": What US Media Reported On PM Modi, Putin MeetingPM Modi and Putin met for the first time after the US imposed tariffs on India and shared bonhomie with handshakes, hugs, and long talks.\r\nEdited by:\r\nManjiri Chitre\r\nWorld News\r\nSep 02, 2025 14:20 pm IST\r\nPublished On\r\nSep 02, 2025 14:14 pm IST\r\nLast Updated On\r\nSep 02, 2025 14:20 pm IST\r\nRead Time:\r\n2 mins\r\nShare\r\nTwitterWhatsAppFacebookRedditEmail\r\n\"Rebuke To Trump\": What US Media Reported On PM Modi, Putin Meeting\r\nUS has imposed 50 per cent tariffs on India over its Russian oil imports.\r\n\r\nShow\r\nQuick ReadSummary is AI-generated, newsroom-reviewed\r\nDid our AI summary help?\r\nLet us know.\r\nSwitch To Beeps Mode\r\nThe two-day Shanghai Cooperation Organisation (SCO) in China became a stage for Prime Minister Narendra Modi and Russian President Vladimir Putin to showcase their unity amid US President Donald Trump's high tariffs on India over its Russian oil imports. The two leaders met for the first time after the tariff imposition and shared bonhomie with handshakes, hugs, and long talks. They even travelled together from the Summit venue to their bilateral meeting hall in the same car - for which Putin reportedly waited about 10 minutes for PM Modi.\r\n\r\nMany pictures and videos of PM Modi and Putin walking hand-in-hand went viral. Another video showed the two leaders and Chinese President Xi Jinping sharing a lighter moment with smiles and handshakes. This show of friendship indicated that India would not ruin its ties with Russia despite the US threats.\r\n\r\nThe powerful photos of the two leaders, even with Chinese President Xi Jinping, made headlines in the US media - with The New York Times noting how India's \"risk-averse bureaucracy\" would have usually avoided such an obvious display of warmth with China and Russia to avoid irking Washington. In an article on the SCO Summit, it said that India is left with \"little incentive\" to \"pull itself back\" due to the sweeping tariffs. The NYT, in its report, also said PM Modi's social media posts with the Russian and Chinese leaders reflected how its \"juggling act has been upended\".\r\n\r\n\"Rebuke To Trump\": What US Media Reported On PM Modi, Putin MeetingPM Modi and Putin met for the first time after the US imposed tariffs on India and shared bonhomie with handshakes, hugs, and long talks.\r\nEdited by:\r\nManjiri Chitre\r\nWorld News\r\nSep 02, 2025 14:20 pm IST\r\nPublished On\r\nSep 02, 2025 14:14 pm IST\r\nLast Updated On\r\nSep 02, 2025 14:20 pm IST\r\nRead Time:\r\n2 mins\r\nShare\r\nTwitterWhatsAppFacebookRedditEmail\r\n\"Rebuke To Trump\": What US Media Reported On PM Modi, Putin Meeting\r\nUS has imposed 50 per cent tariffs on India over its Russian oil imports.\r\n\r\nShow\r\nQuick ReadSummary is AI-generated, newsroom-reviewed\r\nDid our AI summary help?\r\nLet us know.\r\nSwitch To Beeps Mode\r\nThe two-day Shanghai Cooperation Organisation (SCO) in China became a stage for Prime Minister Narendra Modi and Russian President Vladimir Putin to showcase their unity amid US President Donald Trump's high tariffs on India over its Russian oil imports. The two leaders met for the first time after the tariff imposition and shared bonhomie with handshakes, hugs, and long talks. They even travelled together from the Summit venue to their bilateral meeting hall in the same car - for which Putin reportedly waited about 10 minutes for PM Modi.\r\n\r\nMany pictures and videos of PM Modi and Putin walking hand-in-hand went viral. Another video showed the two leaders and Chinese President Xi Jinping sharing a lighter moment with smiles and handshakes. This show of friendship indicated that India would not ruin its ties with Russia despite the US threats.\r\n\r\n\r\n\r\nThe powerful photos of the two leaders, even with Chinese President Xi Jinping, made headlines in the US media - with The New York Times noting how India's \"risk-averse bureaucracy\" would have usually avoided such an obvious display of warmth with China and Russia to avoid irking Washington. In an article on the SCO Summit, it said that India is left with \"little incentive\" to \"pull itself back\" due to the sweeping tariffs. The NYT, in its report, also said PM Modi's social media posts with the Russian and Chinese leaders reflected how its \"juggling act has been upended\".\r\n\r\n\r\n\r\nThe NYT described the photo of PM Modi, Xi Jinping, and Putin holding hands as a \"smiling manifestation of a troika that Moscow had recently said it hoped to revive\".\r\n\r\nNBC News reported that PM Modi's closeness with the two leaders could be seen as a \"rebuke\" to Trump.\r\n\r\nCNN, which headlined its report 'Xi and Modi talk friendship in a 'chaotic' world as Trump's tariffs bite', said that Trump's tariffs have threatened \"years of efforts from US diplomats to deepen ties with the country as a key counterweight to a rising and increasingly assertive China.\" It added that the positive signals and warmth between the three countries will be closely watched by the Trump administration.\r\n\r\nAssociated Press said that Trump's tariffs on India have pushed New Delhi closer to China and Russia.",
      "state": "Delhi",
      "videoUrl": "https://res.cloudinary.com/diuimvolk/video/upload/v1756895666/breaking-news/qa6gbwz0qagsi3jy3v81.mp4",
      "thumbnail": "https://res.cloudinary.com/diuimvolk/image/upload/v1756895667/breaking-news-thumbnails/yh1fuyyoylpwmoklzrbb.webp",
      "youtubeUrl": "https://youtu.be/-1MSM4WUV8M?si=AReWoM-3anc0vz23",
      "timestamp": "2025-09-03T10:34:28.331Z"
    },
    {
      "id": 1756895395213,
      "headline": "Test Fixed Validation",
      "shortDescription": "Test description",
      "fullDescription": "Full test description",
      "state": "Delhi",
      "videoUrl": "",
      "thumbnail": "",
      "youtubeUrl": "",
      "timestamp": "2025-09-03T10:29:55.213Z"
    },
    {
      "id": 1756895060207,
      "headline": "Test Breaking News",
      "shortDescription": "Test description",
      "fullDescription": "Full test description",
      "state": "Delhi",
      "videoUrl": "",
      "thumbnail": "",
      "youtubeUrl": "",
      "timestamp": "2025-09-03T10:24:20.207Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Delhi"
    },
    {
      "id": 2,
      "name": "Maharashtra"
    },
    {
      "id": 3,
      "name": "Uttar Pradesh"
    }
  ],
  "news": [
    {
      "id": 1756886919763,
      "title": "Investigative Report Details “Meltdown” of Russia’s Wagner Group in Mali",
      "content": "Charles Cater, Director of Investigations at The Sentry, said: “The Wagner Group’s intervention in Mali has been a failure. Heavy-handed and poorly informed counter-terrorism operations have strengthened alliances among armed groups challenging the state, caused substantial battlefield losses for Wagner, and resulted in higher civilian casualties. Wagner’s presence has also increased political fragmentation and tensions within the junta that hired them, while coming at an unsustainably high economic cost. Ultimately, Wagner’s deployment has not served the interests of the people of Mali, the military government, or even the mercenary group itself.”\r\n\r\nOliver Windridge, Senior Advisor for UK and EU at The Sentry, said: “So far, the European Union and its member states have been reacting with alarm to the specter of Russia’s encroachment into the Sahel and other African countries. But the European Union may be operating on an outdated understanding of Wagner’s strength and tactics. As the cracks in Wagner’s operations have been revealed, alternative options may also be emerging for Brussels, London, and Washington to exert influence with Sahelian leaders toward better outcomes for their countries.”\r\n\r\nKey report insights:\r\n\r\nDespite the Wagner Group possessing a reputation for being battle-ready and claiming occasional public triumphs in Mali—and ultimately declaring that it had accomplished its mission—its strategy has been plagued by a series of\r\nWagner forces have been unable to take control of areas in the north and center of the country where armed terrorist and separatist groups are challenging the authority of the Malian state.\r\nFaced with challenges such as insufficient air support, a lack of trust, and a lack of reliable information from informants, the Wagner Group has become more reactive and violent.\r\nWagner’s playbook in Mali has not only affected the civilian population; it has also helped perpetuate insecurity and has paved the way for the fragmentation of the Malian state. Wagner fighters have created chaos and fear within the Malian military hierarchy, forcing the Forces Armées Maliennes (Malian Armed Forces, or FAMA) to remain silent in cases of civilian abuse. In addition, the lack of order and communication within the chain of command has led to the progressive deterioration of the FAMA’s ranks.\r\nAt the outset of its Malian venture, Wagner was seeking to secure mining concessions that would likely replicate the group’s self-funding arrangements in other countries. However, the Malian junta appears unwilling to allow Wagner to control the mining sector, and Wagner’s forays into that sector have thus far been limited.\r\nAbuses against the Malian armed forces by Wagner troops have increased, as have complaints from Malian soldiers.\r\nWithin the Malian military junta itself, the varying degrees of partnership with Russian actors are contributing to a shift in power relations in Bamako, as Malian leaders regard one another with suspicion.\r\nKey recommendations in the report:\r\n\r\nThe Office of the Prosecutor at the International Criminal Court (ICC) should open an investigation into war crimes perpetrated by Wagner troops in Mali and prosecute those responsible for human rights abuses. Alternatively, the United Nations Security Council should refer Wagner abuses in Mali to the Office of the Prosecutor at the ICC.\r\nThe government of Mali should take steps toward criminal accountability and reparations for the victims of massacres such as Moura, as well as for the abuses against and displacement of civilian populations following attacks by the Wagner Group in the north and west of the country.\r\nThe EU, the US, the UK, Canada, and Australia should investigate and, if appropriate, designate for sanctions the network of individuals and entities in Sadio Camara’s inner circle who enable, support, or benefit from Wagner’s presence in the country, as well as those involved in corruption and human rights abuses. They should coordinate sanctions to increase their impact.\r\nInternational mining companies operating in Mali and foreign refineries processing Malian gold should conduct comprehensive audits of their operations to ensure that they are not conducting business with sanctioned Wagner Group entities or individuals, such as Ivan Maslov.\r\nThe Algerian government should facilitate renewed negotiations on a peace agreement between Bamako and the northern rebel groups. As the political and security landscape has changed since the 2015 agreement, which was facilitated by Algeria, including as a result of the withdrawal of the UN peacekeeping operation MINUSMA, new terms will need to be agreed.",
      "category": "Politics",
      "imageUrl": "https://res.cloudinary.com/diuimvolk/image/upload/v1756886919/news/nsluhbfdzjiee4kiyboe.png",
      "timestamp": "2025-09-03T08:08:39.763Z"
    }
  ],
  "activities": [
    {
      "id": 1757062758757,
      "type": "news",
      "title": "Article deleted: \"Sports Update: Cricket World Cup Final\"",
      "user": "Admin User",
      "status": "deleted",
      "timestamp": "2025-09-05T08:59:18.757Z"
    },
    {
      "id": 1757062755978,
      "type": "news",
      "title": "Article deleted: \"Breaking: Major Technology Breakthrough in Quantum...\"",
      "user": "Admin User",
      "status": "deleted",
      "timestamp": "2025-09-05T08:59:15.978Z"
    },
    {
      "id": 1756898660217,
      "type": "featured-story",
      "title": "New featured story published: \"The Stunning Transformation of Hailey Bieber — Her...\"",
      "user": "Admin User",
      "status": "published",
      "timestamp": "2025-09-03T11:24:20.217Z"
    },
    {
      "id": 1756896370421,
      "type": "featured-story",
      "title": "New featured story published: \"Health Revolution: New Medical Breakthrough\"",
      "user": "Admin User",
      "status": "published",
      "timestamp": "2025-09-03T10:46:10.421Z"
    },
    {
      "id": 1756896300230,
      "type": "featured-story",
      "title": "New featured story published: \"Breaking: New Technology Revolution\"",
      "user": "Admin User",
      "status": "published",
      "timestamp": "2025-09-03T10:45:00.230Z"
    },
    {
      "id": 1756893562585,
      "type": "news",
      "title": "New article published: \"Sports Update: Cricket World Cup Final\"",
      "user": "Admin User",
      "status": "published",
      "timestamp": "2025-09-03T09:59:22.585Z"
    },
    {
      "id": 1756893529389,
      "type": "news",
      "title": "Article updated: \"Breaking: Major Technology Breakthrough in Quantum...\"",
      "user": "Admin User",
      "status": "updated",
      "timestamp": "2025-09-03T09:58:49.389Z"
    },
    {
      "id": 1756893506925,
      "type": "news",
      "title": "New article published: \"Breaking: New Technology Breakthrough\"",
      "user": "Admin User",
      "status": "published",
      "timestamp": "2025-09-03T09:58:26.925Z"
    }
  ],
  "featuredStories": [
    {
      "id": 1756896300230,
      "title": "Breaking: New Technology Revolution",
      "description": "A groundbreaking innovation is changing the tech landscape forever",
      "content": "Full story about the revolutionary technology that is set to transform industries worldwide. This innovation promises to deliver unprecedented capabilities and efficiency.",
      "category": "Technology",
      "state": "Delhi",
      "excerpt": "Revolutionary tech innovation transforms industries",
      "imageUrl": "",
      "priority": 1,
      "views": "0",
      "timestamp": "2025-09-03T10:45:00.230Z"
    },
    {
      "id": 1756896370420,
      "title": "Health Revolution: New Medical Breakthrough",
      "description": "Scientists discover a revolutionary treatment that could change healthcare forever",
      "content": "Medical researchers have announced a groundbreaking discovery that promises to revolutionize treatment approaches for various conditions.",
      "category": "Health",
      "state": "Mumbai",
      "excerpt": "Medical breakthrough promises healthcare revolution",
      "imageUrl": "",
      "priority": 2,
      "views": "0",
      "timestamp": "2025-09-03T10:46:10.420Z"
    },
    {
      "id": 1756898660213,
      "title": "The Stunning Transformation of Hailey Bieber — Her Life, Career, and Love Story",
      "description": "The Stunning Transformation of Hailey Bieber — Her Life, Career, and Love Story",
      "content": "In 2009, actor Stephen Baldwin introduced his star-struck daughter, Hailey, to Justin Bieber. That awkward 13-year-old blossomed into a supermodel and went on to marry the Canadian pop star, and have his child. She also founded Rhode Skincare, which she sold for a cool billion dollars! So, join us for the stunning transformation of Hailey Bieber: her life, career, and love story…\r\n\r\nHailey Bieber was born Hailey Rhode Baldwin on November 22nd, 1996, in Tucson, Arizona. She was born into semi-Hollywood royalty as her father, Stephen Baldwin, is the youngest of the famous Baldwin brothers actors — which includes her uncles Alec, William, and Daniel.\r\n\r\nHer mother is graphic designer Kennya Deodat, whose grandfather was the famous Brazilian musician Eumir Deodato. Hailey has a sister, Alaia, who’s also a model. Stephen and Kennya must have known their baby daughter was going to be a star, as they named her after Halley’s comet!\r\n\r\nBouncing Off the Walls\r\n\r\nStephen and Kennya had their hands full with little Hailey, as she literally couldn't sit still for two seconds. In a 2018 interview with _The Times_, Stephen revealed that she was a bit rambunctious in her youth, and was \"all over the place and bouncing off the walls\" because she was \r\ndiagnosed with \"really bad\" attention-deficit disorder.\r\n\r\nDesperate to channel that insane energy, they stuck her in ballet classes when she was four. For 12 years, Hailey trained five days a week, with stereotypically strict Russian teachers.\r\n\r\nIn 2005, nine-year-old Hailey appeared with her famous father in the religious TV special, _Livin’ It: Unusual Suspects_. Four years later, Hailey and Uncle Alec introduced the Jonas Brothers on _Saturday Night Live_. Backstage, and immortalised on video, her dad introduces 15-year-old pop singer Justin Bieber to his daughter.\r\n\r\nLooking nervous and uncomfortable, 13-year-old Hailey shook Justin’s hand. Justin couldn’t have guessed that they would end up as a Hollywood power couple, but maybe Hailey could, as some fans 'beliebe' she became obsessed with JB.",
      "category": "Lifestyle",
      "state": "",
      "excerpt": "The Stunning Transformation of Hailey Bieber — Her Life, Career, and Love Story",
      "imageUrl": "https://res.cloudinary.com/diuimvolk/image/upload/v1756898659/featured-stories/auqswnirdthvnvxabbqg.avif",
      "priority": 2,
      "views": "0",
      "timestamp": "2025-09-03T11:24:20.213Z"
    }
  ]
}